---
kind: property
id: P:Autodesk.Revit.DB.TransmissionData.UserData
source: html/226b59dd-7774-1d0e-62b5-8893ad2cf4a9.htm
---
# Autodesk.Revit.DB.TransmissionData.UserData Property

A string which users can store notes in.

## Syntax (C#)
```csharp
public string UserData { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null